uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B_regs.h
#define ADC_1_UABH_B_SW_CB_IN0_ADDR                (ADC_1_UABH_B_halfuab__SW_CB_IN0)
#define ADC_1_UABH_B_SW_CB_IN0_PTR                ((reg32*)ADC_1_UABH_B_SW_CB_IN0_ADDR)
#define ADC_1_UABH_B_SW_CB_IN0_REG                (*(ADC_1_UABH_B_SW_CB_IN0_PTR))

#define ADC_1_UABH_B_SW_CB_IN1_ADDR                (ADC_1_UABH_B_halfuab__SW_CB_IN1)
#define ADC_1_UABH_B_SW_CB_IN1_PTR                ((reg32*)ADC_1_UABH_B_SW_CB_IN1_ADDR)
#define ADC_1_UABH_B_SW_CB_IN1_REG                (*(ADC_1_UABH_B_SW_CB_IN1_PTR))

#define ADC_1_UABH_B_SW_CB_TOP_ADDR                (ADC_1_UABH_B_halfuab__SW_CB_TOP)
#define ADC_1_UABH_B_SW_CB_TOP_PTR                ((reg32*)ADC_1_UABH_B_SW_CB_TOP_ADDR)
#define ADC_1_UABH_B_SW_CB_TOP_REG                (*(ADC_1_UABH_B_SW_CB_TOP_PTR))

#define ADC_1_UABH_B_SW_CC_IN0_ADDR                (ADC_1_UABH_B_halfuab__SW_CC_IN0)
#define ADC_1_UABH_B_SW_CC_IN0_PTR                ((reg32*)ADC_1_UABH_B_SW_CC_IN0_ADDR)
#define ADC_1_UABH_B_SW_CC_IN0_REG                (*(ADC_1_UABH_B_SW_CC_IN0_PTR))

#define ADC_1_UABH_B_SW_CC_IN1_ADDR                (ADC_1_UABH_B_halfuab__SW_CC_IN1)
#define ADC_1_UABH_B_SW_CC_IN1_PTR                ((reg32*)ADC_1_UABH_B_SW_CC_IN1_ADDR)
#define ADC_1_UABH_B_SW_CC_IN1_REG                (*(ADC_1_UABH_B_SW_CC_IN1_PTR))

#define ADC_1_UABH_B_SW_CC_TOP_ADDR                (ADC_1_UABH_B_halfuab__SW_CC_TOP)
#define ADC_1_UABH_B_SW_CC_TOP_PTR                ((reg32*)ADC_1_UABH_B_SW_CC_TOP_ADDR)
#define ADC_1_UABH_B_SW_CC_TOP_REG                (*(ADC_1_UABH_B_SW_CC_TOP_PTR))

#define ADC_1_UABH_B_SW_CF_BOT_ADDR                (ADC_1_UABH_B_halfuab__SW_CF_BOT)
#define ADC_1_UABH_B_SW_CF_BOT_PTR                ((reg32*)ADC_1_UABH_B_SW_CF_BOT_ADDR)
#define ADC_1_UABH_B_SW_CF_BOT_REG                (*(ADC_1_UABH_B_SW_CF_BOT_PTR))

#define ADC_1_UABH_B_SW_OTHER_ADDR                 (ADC_1_UABH_B_halfuab__SW_OTHER)
#define ADC_1_UABH_B_SW_OTHER_PTR                 ((reg32*)ADC_1_UABH_B_SW_OTHER_ADDR)
#define ADC_1_UABH_B_SW_OTHER_REG                 (*(ADC_1_UABH_B_SW_OTHER_PTR))

#define ADC_1_UABH_B_SW_BOOST_CTRL_ADDR            (ADC_1_UABH_B_halfuab__SW_BOOST_CTRL)
#define ADC_1_UABH_B_SW_BOOST_CTRL_PTR            ((reg32*)ADC_1_UABH_B_SW_BOOST_CTRL_ADDR)
#define ADC_1_UABH_B_SW_BOOST_CTRL_REG            (*(ADC_1_UABH_B_SW_BOOST_CTRL_PTR))

#define ADC_1_UABH_B_SRAM_CTRL_ADDR                (ADC_1_UABH_B_halfuab__SRAM_CTRL)
#define ADC_1_UABH_B_SRAM_CTRL_PTR                ((reg32*)ADC_1_UABH_B_SRAM_CTRL_ADDR)
#define ADC_1_UABH_B_SRAM_CTRL_REG                (*(ADC_1_UABH_B_SRAM_CTRL_PTR))

#define ADC_1_UABH_B_STAT_ADDR                     (ADC_1_UABH_B_halfuab__STAT)
#define ADC_1_UABH_B_STAT_PTR                     ((reg32*)ADC_1_UABH_B_STAT_ADDR)
#define ADC_1_UABH_B_STAT_REG                     (*(ADC_1_UABH_B_STAT_PTR))

#define ADC_1_UABH_B_SRAM0_ADDR                    (ADC_1_UABH_B_halfuab__SRAM0)
#define ADC_1_UABH_B_SRAM0_PTR                    ((reg32*)ADC_1_UABH_B_SRAM0_ADDR)
#define ADC_1_UABH_B_SRAM0_REG                    (*(ADC_1_UABH_B_SRAM0_PTR))

#define ADC_1_UABH_B_SRAM1_ADDR                    (ADC_1_UABH_B_halfuab__SRAM1)
#define ADC_1_UABH_B_SRAM1_PTR                    ((reg32*)ADC_1_UABH_B_SRAM1_ADDR)
#define ADC_1_UABH_B_SRAM1_REG                    (*(ADC_1_UABH_B_SRAM1_PTR))

#define ADC_1_UABH_B_SRAM2_ADDR                    (ADC_1_UABH_B_halfuab__SRAM2)
#define ADC_1_UABH_B_SRAM2_PTR                    ((reg32*)ADC_1_UABH_B_SRAM2_ADDR)
#define ADC_1_UABH_B_SRAM2_REG                    (*(ADC_1_UABH_B_SRAM2_PTR))

#define ADC_1_UABH_B_SRAM3_ADDR                    (ADC_1_UABH_B_halfuab__SRAM3)
#define ADC_1_UABH_B_SRAM3_PTR                    ((reg32*)ADC_1_UABH_B_SRAM3_ADDR)
#define ADC_1_UABH_B_SRAM3_REG                    (*(ADC_1_UABH_B_SRAM3_PTR))

#define ADC_1_UABH_B_SRAM4_ADDR                    (ADC_1_UABH_B_halfuab__SRAM4)
#define ADC_1_UABH_B_SRAM4_PTR                    ((reg32*)ADC_1_UABH_B_SRAM4_ADDR)
#define ADC_1_UABH_B_SRAM4_REG                    (*(ADC_1_UABH_B_SRAM4_PTR))

#define ADC_1_UABH_B_SRAM5_ADDR                    (ADC_1_UABH_B_halfuab__SRAM5)
#define ADC_1_UABH_B_SRAM5_PTR                    ((reg32*)ADC_1_UABH_B_SRAM5_ADDR)
#define ADC_1_UABH_B_SRAM5_REG                    (*(ADC_1_UABH_B_SRAM5_PTR))

#define ADC_1_UABH_B_SRAM6_ADDR                    (ADC_1_UABH_B_halfuab__SRAM6)
#define ADC_1_UABH_B_SRAM6_PTR                    ((reg32*)ADC_1_UABH_B_SRAM6_ADDR)
#define ADC_1_UABH_B_SRAM6_REG                    (*(ADC_1_UABH_B_SRAM6_PTR))

#define ADC_1_UABH_B_SRAM7_ADDR                    (ADC_1_UABH_B_halfuab__SRAM7)
#define ADC_1_UABH_B_SRAM7_PTR                    ((reg32*)ADC_1_UABH_B_SRAM7_ADDR)
#define ADC_1_UABH_B_SRAM7_REG                    (*(ADC_1_UABH_B_SRAM7_PTR))

#define ADC_1_UABH_B_SRAM8_ADDR                    (ADC_1_UABH_B_halfuab__SRAM8)
#define ADC_1_UABH_B_SRAM8_PTR                    ((reg32*)ADC_1_UABH_B_SRAM8_ADDR)
#define ADC_1_UABH_B_SRAM8_REG                    (*(ADC_1_UABH_B_SRAM8_PTR))

#define ADC_1_UABH_B_SRAM9_ADDR                    (ADC_1_UABH_B_halfuab__SRAM9)
#define ADC_1_UABH_B_SRAM9_PTR                    ((reg32*)ADC_1_UABH_B_SRAM9_ADDR)
#define ADC_1_UABH_B_SRAM9_REG                    (*(ADC_1_UABH_B_SRAM9_PTR))

#define ADC_1_UABH_B_SRAM10_ADDR                   (ADC_1_UABH_B_halfuab__SRAM10)
#define ADC_1_UABH_B_SRAM10_PTR                   ((reg32*)ADC_1_UABH_B_SRAM10_ADDR)
#define ADC_1_UABH_B_SRAM10_REG                   (*(ADC_1_UABH_B_SRAM10_PTR))

#define ADC_1_UABH_B_SRAM11_ADDR                   (ADC_1_UABH_B_halfuab__SRAM11)
#define ADC_1_UABH_B_SRAM11_PTR                   ((reg32*)ADC_1_UABH_B_SRAM11_ADDR)
#define ADC_1_UABH_B_SRAM11_REG                   (*(ADC_1_UABH_B_SRAM11_PTR))

#define ADC_1_UABH_B_SRAM12_ADDR                   (ADC_1_UABH_B_halfuab__SRAM12)
#define ADC_1_UABH_B_SRAM12_PTR                   ((reg32*)ADC_1_UABH_B_SRAM12_ADDR)
#define ADC_1_UABH_B_SRAM12_REG                   (*(ADC_1_UABH_B_SRAM12_PTR))

#define ADC_1_UABH_B_SRAM13_ADDR                   (ADC_1_UABH_B_halfuab__SRAM13)
#define ADC_1_UABH_B_SRAM13_PTR                   ((reg32*)ADC_1_UABH_B_SRAM13_ADDR)
#define ADC_1_UABH_B_SRAM13_REG                   (*(ADC_1_UABH_B_SRAM13_PTR))

