uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B_regs.h
#define ADC_1_UABH_B_SRAM14_ADDR                   (ADC_1_UABH_B_halfuab__SRAM14)
#define ADC_1_UABH_B_SRAM14_PTR                   ((reg32*)ADC_1_UABH_B_SRAM14_ADDR)
#define ADC_1_UABH_B_SRAM14_REG                   (*(ADC_1_UABH_B_SRAM14_PTR))

#define ADC_1_UABH_B_SRAM15_ADDR                   (ADC_1_UABH_B_halfuab__SRAM15)
#define ADC_1_UABH_B_SRAM15_PTR                   ((reg32*)ADC_1_UABH_B_SRAM15_ADDR)
#define ADC_1_UABH_B_SRAM15_REG                   (*(ADC_1_UABH_B_SRAM15_PTR))

#define ADC_1_UABH_B_SW_CC1_IN0_ADDR               (ADC_1_UABH_B_halfuab__SW_CC1_IN0)
#define ADC_1_UABH_B_SW_CC1_IN0_PTR               ((reg32*)ADC_1_UABH_B_SW_CC1_IN0_ADDR)
#define ADC_1_UABH_B_SW_CC1_IN0_REG               (*(ADC_1_UABH_B_SW_CC1_IN0_PTR))

#define ADC_1_UABH_B_SW_CC1_IN1_ADDR               (ADC_1_UABH_B_halfuab__SW_CC1_IN1)
#define ADC_1_UABH_B_SW_CC1_IN1_PTR               ((reg32*)ADC_1_UABH_B_SW_CC1_IN1_ADDR)
#define ADC_1_UABH_B_SW_CC1_IN1_REG               (*(ADC_1_UABH_B_SW_CC1_IN1_PTR))

#define ADC_1_UABH_B_SW_CC1_TOP_ADDR               (ADC_1_UABH_B_halfuab__SW_CC1_TOP)
#define ADC_1_UABH_B_SW_CC1_TOP_PTR               ((reg32*)ADC_1_UABH_B_SW_CC1_TOP_ADDR)
#define ADC_1_UABH_B_SW_CC1_TOP_REG               (*(ADC_1_UABH_B_SW_CC1_TOP_PTR))

#define ADC_1_UABH_B_CAP_TRIM_ADDR                 (ADC_1_UABH_B_halfuab__CAP_TRIM)
#define ADC_1_UABH_B_CAP_TRIM_PTR                 ((reg32*)ADC_1_UABH_B_CAP_TRIM_ADDR)
#define ADC_1_UABH_B_CAP_TRIM_REG                 (*(ADC_1_UABH_B_CAP_TRIM_PTR))

#define ADC_1_UABH_B_OA_TRIM_ADDR                  (ADC_1_UABH_B_halfuab__OA_TRIM)
#define ADC_1_UABH_B_OA_TRIM_PTR                  ((reg32*)ADC_1_UABH_B_OA_TRIM_ADDR)
#define ADC_1_UABH_B_OA_TRIM_REG                  (*(ADC_1_UABH_B_OA_TRIM_PTR))

/* Starting address for half UAB region */
#define ADC_1_UABH_B_BASE_ADDR                    (ADC_1_UABH_B_halfuab__OA_CTRL)
    



/*Register Field Definitions*/

    
/*UAB_CTRL*/
#define ADC_1_UABH_B_ENABLED_SHIFT                CyUAB_ENABLED_SHIFT
#define ADC_1_UABH_B_ENABLED_MASK                 (1UL<<ADC_1_UABH_B_ENABLED_SHIFT)


/*INTR*/
#if ADC_1_UABH_B_ISODD==1
    #define ADC_1_UABH_B_INTR_COMP_SHIFT CyUAB_INTR_COMP1_SHIFT
#else
    #define ADC_1_UABH_B_INTR_COMP_SHIFT CyUAB_INTR_COMP0_SHIFT
#endif
#define ADC_1_UABH_B_INTR_COMP_MASK               (1UL<<ADC_1_UABH_B_INTR_COMP_SHIFT)

#if ADC_1_UABH_B_ISODD==1
   #define ADC_1_UABH_B_INTR_VDAC_EMPTY_SHIFT CyUAB_INTR_VDAC1_EMPTY_SHIFT
#else
   #define ADC_1_UABH_B_INTR_VDAC_EMPTY_SHIFT CyUAB_INTR_VDAC0_EMPTY_SHIFT
#endif
#define ADC_1_UABH_B_INTR_VDAC_EMPTY_MASK         (1UL<<ADC_1_UABH_B_INTR_VDAC_EMPTY_SHIFT)


/*INTR_SET*/
#define ADC_1_UABH_B_INTR_COMP_SET_SHIFT          ADC_1_UABH_B_INTR_COMP_SHIFT
#define ADC_1_UABH_B_INTR_COMP_SET_MASK           (1UL<<ADC_1_UABH_B_INTR_COMP_SET_SHIFT)

#define ADC_1_UABH_B_INTR_VDAC_EMPTY_SET_SHIFT    ADC_1_UABH_B_INTR_VDAC_EMPTY_SHIFT
#define ADC_1_UABH_B_INTR_VDAC_EMPTY_SET_MASK     (1UL<<ADC_1_UABH_B_INTR_VDAC_EMPTY_SET_SHIFT)


/*INTR_MASK*/
#define ADC_1_UABH_B_INTR_COMP_MASK_SHIFT         ADC_1_UABH_B_INTR_COMP_SHIFT
#define ADC_1_UABH_B_INTR_COMP_MASK_MASK          (1UL<<ADC_1_UABH_B_INTR_COMP_MASK_SHIFT)

#define ADC_1_UABH_B_INTR_VDAC_EMPTY_MASK_SHIFT   ADC_1_UABH_B_INTR_VDAC_EMPTY_SHIFT
#define ADC_1_UABH_B_INTR_VDAC_EMPTY_MASK_MASK    (1UL<<ADC_1_UABH_B_INTR_VDAC_EMPTY_MASK_SHIFT)


/*INTR_MASKED*/
#define ADC_1_UABH_B_INTR_COMP_MASKED_SHIFT       ADC_1_UABH_B_INTR_COMP_SHIFT
#define ADC_1_UABH_B_INTR_COMP_MASKED_MASK        (1UL<<ADC_1_UABH_B_INTR_COMP_MASKED_SHIFT)

#define ADC_1_UABH_B_INTR_VDAC_EMPTY_MASKED_SHIFT ADC_1_UABH_B_INTR_VDAC_EMPTY_SHIFT
#define ADC_1_UABH_B_INTR_VDAC_EMPTY_MASKED_MASK  (1UL<<ADC_1_UABH_B_INTR_VDAC_EMPTY_MASKED_SHIFT)


/*OA_CTRL*/
#define ADC_1_UABH_B_OA_PWR_SHIFT                 CyUAB_OA_PWR_SHIFT
#define ADC_1_UABH_B_OA_PWR_MASK                  (0x7UL<<ADC_1_UABH_B_OA_PWR_SHIFT)

#define ADC_1_UABH_B_CMP_PWR_SHIFT                CyUAB_CMP_PWR_SHIFT
#define ADC_1_UABH_B_CMP_PWR_MASK                 (0x7UL<<ADC_1_UABH_B_CMP_PWR_SHIFT)

#define ADC_1_UABH_B_CMP_EDGE_SHIFT               CyUAB_CMP_EDGE_SHIFT
#define ADC_1_UABH_B_CMP_EDGE_MASK                (0x3UL<<ADC_1_UABH_B_CMP_EDGE_SHIFT)
#define ADC_1_UABH_B_CMP_EDGE_DISABLE             (0UL)
#define ADC_1_UABH_B_CMP_EDGE_RISING              (1UL)
#define ADC_1_UABH_B_CMP_EDGE_FALLING             (2UL)
#define ADC_1_UABH_B_CMP_EDGE_BOTH                (3UL)

#define ADC_1_UABH_B_CMP_DSI_LEVEL_SHIFT          CyUAB_CMP_DSI_LEVEL_SHIFT
#define ADC_1_UABH_B_CMP_DSI_LEVEL_MASK           (1UL<<ADC_1_UABH_B_CMP_DSI_LEVEL_SHIFT)

#define ADC_1_UABH_B_CTRL_SPARE_SHIFT             CyUAB_CTRL_SPARE_SHIFT
#define ADC_1_UABH_B_CTRL_SPARE_MASK              (1UL<<ADC_1_UABH_B_CTRL_SPARE_SHIFT)

#define ADC_1_UABH_B_REF_PWR_SHIFT                CyUAB_REF_PWR_SHIFT
#define ADC_1_UABH_B_REF_PWR_MASK                 (0x7UL<<ADC_1_UABH_B_REF_PWR_SHIFT)

#define ADC_1_UABH_B_REF_PTS_SHIFT                CyUAB_REF_PTS_SHIFT
#define ADC_1_UABH_B_REF_PTS_MASK                 (1UL<<ADC_1_UABH_B_REF_PTS_SHIFT)

#define ADC_1_UABH_B_AGND_PWR_SHIFT               CyUAB_AGND_PWR_SHIFT
#define ADC_1_UABH_B_AGND_PWR_MASK                (0x7UL<<ADC_1_UABH_B_AGND_PWR_SHIFT)

#define ADC_1_UABH_B_AGND_PTS_SHIFT               CyUAB_AGND_PTS_SHIFT
#define ADC_1_UABH_B_AGND_PTS_MASK                (1UL<<ADC_1_UABH_B_AGND_PTS_SHIFT)

#define ADC_1_UABH_B_AGND_TIED_SHIFT              CyUAB_AGND_TIED_SHIFT
#define ADC_1_UABH_B_AGND_TIED_MASK               (1UL<<ADC_1_UABH_B_AGND_TIED_SHIFT)

#define ADC_1_UABH_B_REF_TIED_SHIFT               CyUAB_REF_TIED_SHIFT
#define ADC_1_UABH_B_REF_TIED_MASK                (1UL<<ADC_1_UABH_B_REF_TIED_SHIFT)    
    
#define ADC_1_UABH_B_UAB_PWR_SHIFT                CyUAB_UAB_PWR_SHIFT
#define ADC_1_UABH_B_UAB_PWR_MASK                 (0x3UL<<ADC_1_UABH_B_UAB_PWR_SHIFT)
#define ADC_1_UABH_B_UAB_PWR_NORMAL               (0UL)
#define ADC_1_UABH_B_UAB_PWR_ULTRA_LOW            (1UL)
#define ADC_1_UABH_B_UAB_PWR_ULTRA_HIGH           (2UL)
#define ADC_1_UABH_B_UAB_PWR_Reserved             (3UL)


/*CAP_CTRL*/
#define ADC_1_UABH_B_CB_GND_SHIFT                 CyUAB_CB_GND_SHIFT
#define ADC_1_UABH_B_CB_GND_MASK                  (1UL<<ADC_1_UABH_B_CB_GND_SHIFT)

