uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B_regs.h
/*SW_CA_TOP*/
#define ADC_1_UABH_B_SW_RA_MODBIT_SHIFT           CyUAB_SW_RA_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_RA_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_RA_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_GA_MODBIT_SHIFT           CyUAB_SW_GA_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_GA_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_GA_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_VA_MODBIT_SHIFT           CyUAB_SW_VA_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_VA_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_VA_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_SA_SHIFT                  CyUAB_SW_SA_SHIFT
#define ADC_1_UABH_B_SW_SA_MASK                   (0xfUL<<ADC_1_UABH_B_SW_SA_SHIFT)


/*SW_CB_IN0*/
#define ADC_1_UABH_B_SW_B0_MODBIT_SHIFT           CyUAB_SW_B0_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_B0_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_B0_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_B1_MODBIT_SHIFT           CyUAB_SW_B1_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_B1_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_B1_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_B2_MODBIT_SHIFT           CyUAB_SW_B2_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_B2_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_B2_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_B3_MODBIT_SHIFT           CyUAB_SW_B3_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_B3_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_B3_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_BP_SHIFT                  CyUAB_SW_BP_SHIFT
#define ADC_1_UABH_B_SW_BP_MASK                   (0xfUL<<ADC_1_UABH_B_SW_BP_SHIFT)

#define ADC_1_UABH_B_SW_BQ_SHIFT                  CyUAB_SW_BQ_SHIFT
#define ADC_1_UABH_B_SW_BQ_MASK                   (0xfUL<<ADC_1_UABH_B_SW_BQ_SHIFT)


/*SW_CB_IN1*/
#define ADC_1_UABH_B_SW_BB_SHIFT                  CyUAB_SW_BB_SHIFT
#define ADC_1_UABH_B_SW_BB_MASK                   (0xfUL<<ADC_1_UABH_B_SW_BB_SHIFT)

#define ADC_1_UABH_B_SW_BR_MODBIT_SHIFT           CyUAB_SW_BR_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_BR_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_BR_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_BG_MODBIT_SHIFT           CyUAB_SW_BG_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_BG_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_BG_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_BV_MODBIT_SHIFT           CyUAB_SW_BV_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_BV_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_BV_MODBIT_SHIFT)


/*SW_CB_TOP*/
#define ADC_1_UABH_B_SW_RB_MODBIT_SHIFT           CyUAB_SW_RB_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_RB_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_RB_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_GB_MODBIT_SHIFT           CyUAB_SW_GB_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_GB_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_GB_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_VB_MODBIT_SHIFT           CyUAB_SW_VB_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_VB_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_VB_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_TB_SHIFT                  CyUAB_SW_TB_SHIFT
#define ADC_1_UABH_B_SW_TB_MASK                   (0xfUL<<ADC_1_UABH_B_SW_TB_SHIFT)

#define ADC_1_UABH_B_SW_SB_SHIFT                  CyUAB_SW_SB_SHIFT
#define ADC_1_UABH_B_SW_SB_MASK                   (0xfUL<<ADC_1_UABH_B_SW_SB_SHIFT)


/*SW_CC_IN0*/
#define ADC_1_UABH_B_SW_C0_MODBIT_SHIFT           CyUAB_SW_C0_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_C0_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_C0_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_C1_MODBIT_SHIFT           CyUAB_SW_C1_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_C1_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_C1_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_C2_MODBIT_SHIFT           CyUAB_SW_C2_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_C2_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_C2_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_C3_MODBIT_SHIFT           CyUAB_SW_C3_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_C3_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_C3_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_CP_SHIFT                  CyUAB_SW_CP_SHIFT
#define ADC_1_UABH_B_SW_CP_MASK                   (0xfUL<<ADC_1_UABH_B_SW_CP_SHIFT)

#define ADC_1_UABH_B_SW_CQ_SHIFT                  CyUAB_SW_CQ_SHIFT
#define ADC_1_UABH_B_SW_CQ_MASK                   (0xfUL<<ADC_1_UABH_B_SW_CQ_SHIFT)


/*SW_CC_IN1*/
#define ADC_1_UABH_B_SW_CC_SHIFT                  CyUAB_SW_CC_SHIFT
#define ADC_1_UABH_B_SW_CC_MASK                   (0xfUL<<ADC_1_UABH_B_SW_CC_SHIFT)

#define ADC_1_UABH_B_SW_CR_MODBIT_SHIFT           CyUAB_SW_CR_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_CR_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_CR_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_CG_MODBIT_SHIFT           CyUAB_SW_CG_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_CG_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_CG_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_CV_MODBIT_SHIFT           CyUAB_SW_CV_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_CV_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_CV_MODBIT_SHIFT)


/*SW_CC_TOP*/
#define ADC_1_UABH_B_SW_RC_MODBIT_SHIFT           CyUAB_SW_RC_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_RC_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_RC_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_GC_MODBIT_SHIFT           CyUAB_SW_GC_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_GC_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_GC_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_VC_MODBIT_SHIFT           CyUAB_SW_VC_MODBIT_SHIFT
#define ADC_1_UABH_B_SW_VC_MODBIT_MASK            (0xfUL<<ADC_1_UABH_B_SW_VC_MODBIT_SHIFT)

#define ADC_1_UABH_B_SW_TC_SHIFT                  CyUAB_SW_TC_SHIFT
#define ADC_1_UABH_B_SW_TC_MASK                   (0xfUL<<ADC_1_UABH_B_SW_TC_SHIFT)

#define ADC_1_UABH_B_SW_SC_SHIFT                  CyUAB_SW_SC_SHIFT
#define ADC_1_UABH_B_SW_SC_MASK                   (0xfUL<<ADC_1_UABH_B_SW_SC_SHIFT)

#define ADC_1_UABH_B_SW_ZC_SHIFT                  CyUAB_SW_ZC_SHIFT
#define ADC_1_UABH_B_SW_ZC_MASK                   (0xfUL<<ADC_1_UABH_B_SW_ZC_SHIFT)


/*SW_CF_BOT*/
#define ADC_1_UABH_B_SW_GF_SHIFT                  CyUAB_SW_GF_SHIFT
#define ADC_1_UABH_B_SW_GF_MASK                   (0xfUL<<ADC_1_UABH_B_SW_GF_SHIFT)

#define ADC_1_UABH_B_SW_PF_SHIFT                  CyUAB_SW_PF_SHIFT
#define ADC_1_UABH_B_SW_PF_MASK                   (0xfUL<<ADC_1_UABH_B_SW_PF_SHIFT)

#define ADC_1_UABH_B_SW_PS_SHIFT                  CyUAB_SW_PS_SHIFT
#define ADC_1_UABH_B_SW_PS_MASK                   (0xfUL<<ADC_1_UABH_B_SW_PS_SHIFT)

#define ADC_1_UABH_B_SW_PO_SHIFT                  CyUAB_SW_PO_SHIFT
#define ADC_1_UABH_B_SW_PO_MASK                   (0xfUL<<ADC_1_UABH_B_SW_PO_SHIFT)


/*SW_OTHER*/
#define ADC_1_UABH_B_CMP_FF_SHIFT                 CyUAB_CMP_FF_SHIFT
#define ADC_1_UABH_B_CMP_FF_MASK                  (0xfUL<<ADC_1_UABH_B_CMP_FF_SHIFT)

#define ADC_1_UABH_B_VALID_SHIFT                  CyUAB_VALID_SHIFT
#define ADC_1_UABH_B_VALID_MASK                   (0xfUL<<ADC_1_UABH_B_VALID_SHIFT)

#define ADC_1_UABH_B_TRIG_OUT_SHIFT               CyUAB_TRIG_OUT_SHIFT
#define ADC_1_UABH_B_TRIG_OUT_MASK                (0xfUL<<ADC_1_UABH_B_TRIG_OUT_SHIFT)

#define ADC_1_UABH_B_STROBE_SW_SHIFT              CyUAB_STROBE_SW_SHIFT
#define ADC_1_UABH_B_STROBE_SW_MASK               (0xfUL<<ADC_1_UABH_B_STROBE_SW_SHIFT)

