uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_UABH_B_regs.h
#define ADC_1_UABH_B_STROBE_RST_SHIFT             CyUAB_STROBE_RST_SHIFT
#define ADC_1_UABH_B_STROBE_RST_MASK              (0xfUL<<ADC_1_UABH_B_STROBE_RST_SHIFT)


/*SW_BOOST_CTRL*/
#define ADC_1_UABH_B_CA_BOOST_SHIFT               CyUAB_CA_BOOST_SHIFT
#define ADC_1_UABH_B_CA_BOOST_MASK                (0xfUL<<ADC_1_UABH_B_CA_BOOST_SHIFT)

#define ADC_1_UABH_B_CB_BOOST_SHIFT               CyUAB_CB_BOOST_SHIFT
#define ADC_1_UABH_B_CB_BOOST_MASK                (0xfUL<<ADC_1_UABH_B_CB_BOOST_SHIFT)

#define ADC_1_UABH_B_CC_BOOST_SHIFT               CyUAB_CC_BOOST_SHIFT
#define ADC_1_UABH_B_CC_BOOST_MASK                (0xfUL<<ADC_1_UABH_B_CC_BOOST_SHIFT)

#define ADC_1_UABH_B_CF_BOOST_SHIFT               CyUAB_CF_BOOST_SHIFT
#define ADC_1_UABH_B_CF_BOOST_MASK                (0xfUL<<ADC_1_UABH_B_CF_BOOST_SHIFT)

#define ADC_1_UABH_B_SUM_BOOST_SHIFT              CyUAB_SUM_BOOST_SHIFT
#define ADC_1_UABH_B_SUM_BOOST_MASK               (0xfUL<<ADC_1_UABH_B_SUM_BOOST_SHIFT)

#define ADC_1_UABH_B_PUMP_WAVE_SHIFT              CyUAB_PUMP_WAVE_SHIFT
#define ADC_1_UABH_B_PUMP_WAVE_MASK               (0xfUL<<ADC_1_UABH_B_PUMP_WAVE_SHIFT)


/*SRAM_CTRL*/
#define ADC_1_UABH_B_LAST_STEP_SHIFT              CyUAB_LAST_STEP_SHIFT
#define ADC_1_UABH_B_LAST_STEP_MASK               (0xfUL<<ADC_1_UABH_B_LAST_STEP_SHIFT)

#define ADC_1_UABH_B_TRIG_SEL_SHIFT               CyUAB_TRIG_SEL_SHIFT
#define ADC_1_UABH_B_TRIG_SEL_MASK                (0x1fUL<<ADC_1_UABH_B_TRIG_SEL_SHIFT)

#define ADC_1_UABH_B_TRIGGER_EN_SHIFT             CyUAB_TRIGGER_EN_SHIFT
#define ADC_1_UABH_B_TRIGGER_EN_MASK              (1UL<<ADC_1_UABH_B_TRIGGER_EN_SHIFT)

#define ADC_1_UABH_B_RUN_SHIFT                    CyUAB_RUN_SHIFT
#define ADC_1_UABH_B_RUN_MASK                     (1UL<<ADC_1_UABH_B_RUN_SHIFT)


/*STAT*/
#define ADC_1_UABH_B_CURR_STEP_SHIFT              CyUAB_CURR_STEP_SHIFT
#define ADC_1_UABH_B_CURR_STEP_MASK               (0xfUL<<ADC_1_UABH_B_CURR_STEP_SHIFT)

#define ADC_1_UABH_B_COMP_SHIFT                   CyUAB_COMP_SHIFT
#define ADC_1_UABH_B_COMP_MASK                    (1UL<<ADC_1_UABH_B_COMP_SHIFT)

#define ADC_1_UABH_B_CURR_SUBSAMPLE_SHIFT         CyUAB_CURR_SUBSAMPLE_SHIFT
#define ADC_1_UABH_B_CURR_SUBSAMPLE_MASK          (0xffUL<<ADC_1_UABH_B_CURR_SUBSAMPLE_SHIFT)


/*SRAM*/
#define ADC_1_UABH_B_WAVE_STEP_SHIFT              CyUAB_WAVE_STEP_SHIFT
#define ADC_1_UABH_B_WAVE_STEP_MASK               (0x0000ffffUL)


/*CAP_TRIM*/
#define ADC_1_UABH_B_CBTC_VAL_SHIFT               CyUAB_CBTC_VAL_SHIFT
#define ADC_1_UABH_B_CBTC_VAL_MASK                (0x7UL<<ADC_1_UABH_B_CBTC_VAL_SHIFT)

#define ADC_1_UABH_B_CCTC_VAL_SHIFT               CyUAB_CCTC_VAL_SHIFT
#define ADC_1_UABH_B_CCTC_VAL_MASK                (0x7UL<<ADC_1_UABH_B_CCTC_VAL_SHIFT)


/*OA_TRIM*/
#define ADC_1_UABH_B_OA_OFFSET_SHIFT              CyUAB_OA_OFFSET_SHIFT
#define ADC_1_UABH_B_OA_OFFSET_MASK               (0xfUL<<ADC_1_UABH_B_OA_OFFSET_SHIFT)

#define ADC_1_UABH_B_REF_OFFSET_SHIFT             CyUAB_REF_OFFSET_SHIFT
#define ADC_1_UABH_B_REF_OFFSET_MASK              (0x1fUL<<ADC_1_UABH_B_REF_OFFSET_SHIFT)

#define ADC_1_UABH_B_AGND_OFFSET_SHIFT            CyUAB_AGND_OFFSET_SHIFT
#define ADC_1_UABH_B_AGND_OFFSET_MASK             (0x1fUL<<ADC_1_UABH_B_AGND_OFFSET_SHIFT)



#define ADC_1_UABH_B_DAC_NEXT_MASK (CyUAB_DAC_NEXT_MASK)


#endif
